In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('./Yes_Bank_Training.csv')

In [3]:
data.shape

(31649, 18)

In [4]:
data.describe()

,serial_number,age_in_years,balance_in_account,date,call_duration,campaign_contacts,days_passed,previous_contact
count,31649.000000,31649.000000,31649.000000,31649.000000,31649.000000,31649.000000,31649.000000,31649.000000
mean,15825.000000,41.111820,1293.382540,16.597997,252.408196,3.062372,10.819931,0.208537
std,9136.423671,9.597652,2961.185138,8.586414,262.344981,3.510245,48.086849,1.946336
min,1.000000,19.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,7913.000000,33.000000,47.000000,9.000000,98.000000,1.000000,-1.000000,0.000000
50%,15825.000000,40.000000,397.000000,18.000000,171.000000,2.000000,-1.000000,0.000000
75%,23737.000000,49.000000,1328.000000,23.000000,305.000000,3.000000,-1.000000,0.000000
max,31649.000000,94.000000,98417.000000,31.000000,4918.000000,63.000000,335.000000,275.000000

In [5]:
data.head()

,serial_number,age_in_years,job_description,marital_status,education_details,has_default,balance_in_account,housing_status,previous_loan,phone_type,date,month_of_year,call_duration,campaign_contacts,days_passed,previous_contact,poutcome_of_campaign,outcome
0,1,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,2,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,3,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,4,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,5,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [6]:
categorical_data = data[["job_description", "marital_status", "education_details", "has_default", "housing_status", "previous_loan", "phone_type", "date"]]
numerical_data = data.drop(["job_description", "marital_status", "education_details", "has_default", "housing_status", "previous_loan", "phone_type", "month_of_year", "date", "poutcome_of_campaign","outcome", "days_passed", "previous_contact"], axis =1)

In [7]:
numerical_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,261,1
1,2,44,29,151,1
2,3,33,2,76,1
3,4,47,1506,92,1
4,5,33,1,198,1

In [8]:
categorical_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,unknown,5
1,technician,single,secondary,no,yes,no,unknown,5
2,entrepreneur,married,secondary,no,yes,yes,unknown,5
3,blue-collar,married,unknown,no,yes,no,unknown,5
4,unknown,single,unknown,no,no,no,unknown,5

## Outlier removal

Here we are removing outliers from the training as well as testing data. Outliers are those values which are

* greater than μ + 2.σ
* less than μ - 2.σ

In [9]:
main_data = numerical_data.copy(deep=True)

#### for age_in_years

In [10]:
[i for i in zip(*np.unique(main_data["age_in_years"], return_counts = True))]

[(19, 6),
 (20, 10),
 (21, 22),
 (22, 42),
 (23, 84),
 (24, 119),
 (25, 279),
 (26, 506),
 (27, 563),
 (28, 622),
 (29, 700),
 (30, 1203),
 (31, 1436),
 (32, 1455),
 (33, 1320),
 (34, 1287),
 (35, 1298),
 (36, 1266),
 (37, 1173),
 (38, 1043),
 (39, 1072),
 (40, 1006),
 (41, 992),
 (42, 931),
 (43, 863),
 (44, 880),
 (45, 953),
 (46, 906),
 (47, 845),
 (48, 771),
 (49, 795),
 (50, 732),
 (51, 750),
 (52, 723),
 (53, 704),
 (54, 626),
 (55, 625),
 (56, 626),
 (57, 645),
 (58, 582),
 (59, 621),
 (60, 431),
 (61, 42),
 (62, 9),
 (63, 7),
 (64, 8),
 (65, 6),
 (66, 6),
 (67, 4),
 (68, 5),
 (69, 5),
 (70, 4),
 (71, 5),
 (72, 3),
 (73, 5),
 (74, 2),
 (75, 5),
 (76, 2),
 (77, 2),
 (78, 3),
 (79, 1),
 (80, 1),
 (82, 1),
 (83, 6),
 (85, 2),
 (90, 1),
 (94, 1)]

In [11]:
mean, std = np.mean(main_data["age_in_years"]), np.std(main_data["age_in_years"])

In [12]:
min_val , max_val = int(mean- 2 * std), int(mean + 2 *std)

In [13]:
min_val, max_val, mean

(21, 60, 41.11182027868179)

In [14]:
np.random.randint(min_val, max_val)

26

In [15]:
def age_in_years(val):
    if val < 21 or val > 60:
        return np.random.randint(21, 60)
    else:
        return val

In [16]:
main_data["age_in_years"] = main_data["age_in_years"].apply(age_in_years)

In [17]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,261,1
1,2,44,29,151,1
2,3,33,2,76,1
3,4,47,1506,92,1
4,5,33,1,198,1

In [18]:
[i for i in zip(*np.unique(main_data["age_in_years"], return_counts = True))]

[(21, 25),
 (22, 43),
 (23, 88),
 (24, 122),
 (25, 280),
 (26, 513),
 (27, 564),
 (28, 624),
 (29, 705),
 (30, 1208),
 (31, 1437),
 (32, 1458),
 (33, 1323),
 (34, 1293),
 (35, 1300),
 (36, 1271),
 (37, 1177),
 (38, 1048),
 (39, 1079),
 (40, 1010),
 (41, 999),
 (42, 931),
 (43, 869),
 (44, 883),
 (45, 962),
 (46, 909),
 (47, 845),
 (48, 775),
 (49, 799),
 (50, 737),
 (51, 752),
 (52, 730),
 (53, 706),
 (54, 629),
 (55, 630),
 (56, 632),
 (57, 650),
 (58, 588),
 (59, 624),
 (60, 431)]

#### for balance_in_account

In [19]:
mean, std = main_data["balance_in_account"].mean(), main_data["balance_in_account"].std()

In [20]:
mean, std

(1293.382539732693, 2961.185138253838)

In [21]:
min_val, max_val = mean - 2 * std, mean + 2 * std

In [22]:
int(min_val), int(max_val)

(-4628, 7215)

In [23]:
def balance_in_account(val):
    if val < -4628 or val > 7215:
        if val <= -4628:
            return int(-4628)
        else:
            return int(7215)
    else:
        return val

In [24]:
main_data["balance_in_account"] = main_data["balance_in_account"].apply(balance_in_account)

In [25]:
main_data["balance_in_account"].values

array([2143,   29,    2, ..., 7215,    0, 1101], dtype=int64)

In [26]:
main_data["balance_in_account"].mean(), main_data["balance_in_account"].std()

(1100.9988625233025, 1763.8433408011306)

In [27]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,261,1
1,2,44,29,151,1
2,3,33,2,76,1
3,4,47,1506,92,1
4,5,33,1,198,1

#### for campaign_contacts

In [28]:
[i for i in zip(*np.unique(main_data["campaign_contacts"], return_counts = True))]

[(1, 10863),
 (2, 8964),
 (3, 3979),
 (4, 2774),
 (5, 1305),
 (6, 1038),
 (7, 589),
 (8, 454),
 (9, 286),
 (10, 247),
 (11, 179),
 (12, 143),
 (13, 131),
 (14, 91),
 (15, 80),
 (16, 77),
 (17, 68),
 (18, 51),
 (19, 44),
 (20, 43),
 (21, 35),
 (22, 23),
 (23, 21),
 (24, 20),
 (25, 22),
 (26, 13),
 (27, 10),
 (28, 16),
 (29, 16),
 (30, 8),
 (31, 12),
 (32, 9),
 (33, 6),
 (34, 5),
 (35, 4),
 (36, 4),
 (37, 2),
 (38, 3),
 (39, 1),
 (41, 2),
 (43, 3),
 (44, 1),
 (46, 1),
 (50, 2),
 (51, 1),
 (55, 1),
 (58, 1),
 (63, 1)]

In [29]:
mean, std = main_data["campaign_contacts"].mean(), main_data["campaign_contacts"].std()

In [30]:
min_val, max_val = 0 , int(mean + 2 * std)

In [31]:
min_val, max_val

(0, 10)

In [32]:
def campaign_contacts(val):
    if val < 0 or val > 10:
        if val <= 0:
            return int(0)
        else:
            return int(10)
    else:
        return val

In [33]:
main_data["campaign_contacts"] = main_data["campaign_contacts"].apply(campaign_contacts)

In [34]:
[i for i in zip(*np.unique(main_data["campaign_contacts"], return_counts = True))]

[(1, 10863),
 (2, 8964),
 (3, 3979),
 (4, 2774),
 (5, 1305),
 (6, 1038),
 (7, 589),
 (8, 454),
 (9, 286),
 (10, 1397)]

In [35]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,261,1
1,2,44,29,151,1
2,3,33,2,76,1
3,4,47,1506,92,1
4,5,33,1,198,1

In [36]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,261,1
1,2,44,29,151,1
2,3,33,2,76,1
3,4,47,1506,92,1
4,5,33,1,198,1

#### for call_duration

In [37]:
main_data["call_duration"] = main_data["call_duration"]//60 ## in mins

In [38]:
[i for i in zip(*np.unique(main_data["call_duration"], return_counts = True))]

[(0, 3393),
 (1, 6976),
 (2, 6202),
 (3, 4150),
 (4, 2812),
 (5, 1854),
 (6, 1366),
 (7, 961),
 (8, 750),
 (9, 563),
 (10, 500),
 (11, 373),
 (12, 301),
 (13, 235),
 (14, 185),
 (15, 170),
 (16, 132),
 (17, 107),
 (18, 100),
 (19, 96),
 (20, 77),
 (21, 47),
 (22, 41),
 (23, 43),
 (24, 40),
 (25, 29),
 (26, 24),
 (27, 14),
 (28, 15),
 (29, 10),
 (30, 13),
 (31, 12),
 (32, 7),
 (33, 9),
 (34, 4),
 (35, 1),
 (36, 3),
 (37, 4),
 (38, 1),
 (39, 1),
 (40, 4),
 (41, 3),
 (43, 2),
 (44, 2),
 (46, 3),
 (47, 1),
 (50, 1),
 (51, 4),
 (53, 1),
 (54, 2),
 (55, 1),
 (56, 1),
 (57, 1),
 (64, 1),
 (81, 1)]

In [39]:
mean, std = main_data["call_duration"].mean(), main_data["call_duration"].std()

In [40]:
min_val, max_val = 0 , int(mean + 2 * std)

In [41]:
min_val, max_val

(0, 12)

In [42]:
np.sum(np.unique(main_data[main_data["call_duration"] > 12]["call_duration"], return_counts = True)[1])

1448

In [43]:
def call_duration(val):
    if val > 12:
        return 12
    else:
        return val

In [44]:
main_data["call_duration"] = main_data["call_duration"].apply(call_duration)

In [45]:
[i for i in zip(*np.unique(main_data["call_duration"], return_counts = True))]

[(0, 3393),
 (1, 6976),
 (2, 6202),
 (3, 4150),
 (4, 2812),
 (5, 1854),
 (6, 1366),
 (7, 961),
 (8, 750),
 (9, 563),
 (10, 500),
 (11, 373),
 (12, 1749)]

In [46]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,58,2143,4,1
1,2,44,29,2,1
2,3,33,2,1,1
3,4,47,1506,1,1
4,5,33,1,3,1

#### Saving processed data

In [47]:
main_data.to_csv(path_or_buf='./preprocessed_numerical.csv', index=False)

# CATEGORICAL

Here we fill the unknowns with the best feature value which we calculate using the features that are most influential towards the feature being filled.
Here we do an l2 norm to calculate the distance between 'the numerical features of the unknown being replaced' and the numerical features of all the other features that are related to it. 
The feature value with the least l2 norm will be used to replace the unknown.

In [50]:
main_data = categorical_data.copy(deep=True)

#### for job_description

In [51]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,unknown,5
1,technician,single,secondary,no,yes,no,unknown,5
2,entrepreneur,married,secondary,no,yes,yes,unknown,5
3,blue-collar,married,unknown,no,yes,no,unknown,5
4,unknown,single,unknown,no,no,no,unknown,5

In [52]:
[i for i in zip(*np.unique(main_data["job_description"], return_counts = True))]

[('admin.', 3354),
 ('blue-collar', 6948),
 ('entrepreneur', 1160),
 ('housemaid', 969),
 ('management', 6705),
 ('retired', 1232),
 ('self-employed', 1164),
 ('services', 2965),
 ('student', 297),
 ('technician', 5684),
 ('unemployed', 950),
 ('unknown', 221)]

Here we choose "age_in_years" and "balance_in_account" to be most influential with "job_description"

In [53]:
jobs = np.unique(main_data["job_description"])
error = {}
for job in jobs:
    unknown_data, known_data = numerical_data[main_data["job_description"] == "unknown"][["age_in_years","balance_in_account"]], numerical_data[main_data["job_description"] == job][["age_in_years","balance_in_account"]]
    unknown_mean, known_mean = unknown_data.mean(axis=0), known_data.mean(axis=0)
    error[job] = np.mean(np.square(unknown_mean.values - known_mean.values))

In [54]:
sorted(error.items(), key=lambda x: x[1])

[('unknown', 0.0),
 ('management', 8914.843643960354),
 ('retired', 23383.237388607988),
 ('unemployed', 23401.317833891157),
 ('self-employed', 28941.059589948538),
 ('entrepreneur', 62639.059976284356),
 ('housemaid', 71340.00912843308),
 ('student', 76452.50997061955),
 ('technician', 91677.63059503143),
 ('blue-collar', 127296.2988308657),
 ('admin.', 136005.32404623617),
 ('services', 164695.48368097292)]

Here "management" has the least l2 norm, thus we will change unknowns in "job_description" with "management"

In [56]:
def job_description(val):
    if val == "unknown":
        return "management"
    else:
        return val

In [57]:
main_data["job_description"] = main_data["job_description"].apply(job_description)

In [58]:
[i for i in zip(*np.unique(main_data["job_description"], return_counts = True))]

[('admin.', 3354),
 ('blue-collar', 6948),
 ('entrepreneur', 1160),
 ('housemaid', 969),
 ('management', 6926),
 ('retired', 1232),
 ('self-employed', 1164),
 ('services', 2965),
 ('student', 297),
 ('technician', 5684),
 ('unemployed', 950)]

In [59]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,unknown,5
1,technician,single,secondary,no,yes,no,unknown,5
2,entrepreneur,married,secondary,no,yes,yes,unknown,5
3,blue-collar,married,unknown,no,yes,no,unknown,5
4,management,single,unknown,no,no,no,unknown,5

#### education_details

In [60]:
[i for i in zip(*np.unique(main_data["education_details"], return_counts = True))]

[('primary', 4977),
 ('secondary', 16303),
 ('tertiary', 9097),
 ('unknown', 1272)]

Here we choose "age_in_years" and "balance_in_account" to be most influential with "education_details"

In [61]:
edus = np.unique(main_data["education_details"])
error = {}
for edu in edus:
    unknown_data, known_data = numerical_data[main_data["education_details"] == "unknown"][["age_in_years","balance_in_account"]], numerical_data[main_data["education_details"] == edu][["age_in_years","balance_in_account"]]
    unknown_mean, known_mean = unknown_data.mean(axis=0), known_data.mean(axis=0)
    error[edu] = np.mean(np.square(unknown_mean.values - known_mean.values))

sorted(error.items(), key=lambda x: x[1])

[('unknown', 0.0),
 ('tertiary', 2432.5899641893693),
 ('primary', 21286.81852354492),
 ('secondary', 35898.485732467656)]

So, we choose "tertiary" to replace with unknowns.

In [63]:
def education_details(val):
    if val == "unknown":
        return "tertiary"
    else:
        return val

In [64]:
main_data["education_details"] = main_data["education_details"].apply(education_details)

In [65]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,unknown,5
1,technician,single,secondary,no,yes,no,unknown,5
2,entrepreneur,married,secondary,no,yes,yes,unknown,5
3,blue-collar,married,tertiary,no,yes,no,unknown,5
4,management,single,tertiary,no,no,no,unknown,5

In [66]:
[i for i in zip(*np.unique(main_data["education_details"], return_counts = True))]

[('primary', 4977), ('secondary', 16303), ('tertiary', 10369)]

#### phone_type

In [67]:
[i for i in zip(*np.unique(main_data["phone_type"], return_counts = True))]

[('cellular', 17181), ('telephone', 1703), ('unknown', 12765)]

Here we choose "call_duration" to be most influential with "phone_type"

In [68]:
phones = np.unique(main_data["phone_type"])
error = {}
for phone in phones:
    unknown_data, known_data = numerical_data[main_data["phone_type"] == "unknown"]["call_duration"], numerical_data[main_data["phone_type"] == phone]["call_duration"]
    unknown_mean, known_mean = unknown_data.mean(axis=0), known_data.mean(axis=0)
    error[phone] = np.mean(np.sqrt(np.square(unknown_mean - known_mean)))

sorted(error.items(), key=lambda x: x[1])

[('unknown', 0.0),
 ('cellular', 0.06721976035752864),
 ('telephone', 0.7053633377563013)]

hence it will be changed to cellular

In [70]:
def phone_type(val):
    if val == "unknown":
        return 'cellular'
    else:
        return val

In [71]:
main_data["phone_type"] = main_data["phone_type"].apply(phone_type)

In [72]:
[i for i in zip(*np.unique(main_data["phone_type"], return_counts = True))]

[('cellular', 29946), ('telephone', 1703)]

In [73]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,cellular,5
1,technician,single,secondary,no,yes,no,cellular,5
2,entrepreneur,married,secondary,no,yes,yes,cellular,5
3,blue-collar,married,tertiary,no,yes,no,cellular,5
4,management,single,tertiary,no,no,no,cellular,5

#### date

In [74]:
[i for i in zip(*np.unique(main_data["date"], return_counts = True))]

[(1, 90),
 (2, 994),
 (3, 827),
 (4, 962),
 (5, 1362),
 (6, 1353),
 (7, 1036),
 (8, 1128),
 (9, 1288),
 (10, 364),
 (11, 806),
 (12, 797),
 (13, 695),
 (14, 992),
 (15, 729),
 (16, 935),
 (17, 1220),
 (18, 1544),
 (19, 1650),
 (20, 2030),
 (21, 1880),
 (22, 655),
 (23, 793),
 (24, 337),
 (25, 603),
 (26, 769),
 (27, 875),
 (28, 1613),
 (29, 1589),
 (30, 1142),
 (31, 591)]

In [75]:
main_data["date"].describe()

count    31649.000000
mean        16.597997
std          8.586414
min          1.000000
25%          9.000000
50%         18.000000
75%         23.000000
max         31.000000
Name: date, dtype: float64

Here we **categorize** feature "date", using inter-quartile range.

In [76]:
q1, q2, q3 = 9, 18, 23

In [77]:
def date(val):
    if val < 9:
        return "start"
    elif val < 18:
        return "mid-1"
    elif val< 23:
        return "mid-2"
    else:
        return "end"

In [78]:
main_data["date"] = main_data["date"].apply(date)

In [79]:
[i for i in zip(*np.unique(main_data["date"], return_counts = True))]

[('end', 8312), ('mid-1', 7826), ('mid-2', 7759), ('start', 7752)]

In [80]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,management,married,tertiary,no,yes,no,cellular,start
1,technician,single,secondary,no,yes,no,cellular,start
2,entrepreneur,married,secondary,no,yes,yes,cellular,start
3,blue-collar,married,tertiary,no,yes,no,cellular,start
4,management,single,tertiary,no,no,no,cellular,start

In [81]:
main_data.to_csv(path_or_buf='./preprocessed_categorical.csv', index=False)

# TEST DATA

In [82]:
test_data = pd.read_csv('./Yes_Bank_Test.csv')

In [83]:
categorical_data = test_data[["job_description", "marital_status", "education_details", "has_default", "housing_status", "previous_loan", "phone_type", "date"]]
numerical_data = test_data.drop(["job_description", "marital_status", "education_details", "has_default", "housing_status", "previous_loan", "phone_type", "month_of_year", "date", "poutcome_of_campaign", "days_passed", "previous_contact"], axis =1)

### Numerical

In [84]:
main_data = numerical_data.copy(deep=True)

In [85]:
main_data["age_in_years"] = main_data["age_in_years"].apply(age_in_years)
main_data["balance_in_account"] = main_data["balance_in_account"].apply(balance_in_account)
main_data["campaign_contacts"] = main_data["campaign_contacts"].apply(campaign_contacts)
main_data["call_duration"] = main_data["call_duration"]//60 ## in mins
main_data["call_duration"] = main_data["call_duration"].apply(call_duration)

In [86]:
main_data.head()

,serial_number,age_in_years,balance_in_account,call_duration,campaign_contacts
0,1,33,796,3,1
1,2,40,754,10,1
2,3,30,7215,12,2
3,4,44,545,2,3
4,5,35,5553,6,3

In [87]:
main_data.to_csv(path_or_buf='./preprocessed_numerical_test.csv', index=False)

### Catergorical

In [88]:
main_data = categorical_data.copy(deep=True)

In [89]:
main_data["job_description"] = main_data["job_description"].apply(job_description)
main_data["education_details"] = main_data["education_details"].apply(education_details)
main_data["phone_type"] = main_data["phone_type"].apply(phone_type)
main_data["date"] = main_data["date"].apply(date)

In [90]:
main_data.head()

,job_description,marital_status,education_details,has_default,housing_status,previous_loan,phone_type,date
0,admin.,married,secondary,no,yes,no,telephone,start
1,management,married,secondary,no,no,yes,cellular,start
2,technician,single,secondary,no,yes,no,cellular,start
3,blue-collar,married,secondary,no,yes,no,cellular,start
4,technician,married,secondary,no,yes,no,cellular,start

In [91]:
main_data.to_csv(path_or_buf='./preprocessed_categorical_test.csv', index=False)

In [92]:
for col in main_data.columns:
    print([i for i in zip(*np.unique(main_data[col], return_counts = True))])

[('admin.', 1817), ('blue-collar', 2784), ('entrepreneur', 327), ('housemaid', 271), ('management', 2820), ('retired', 1032), ('self-employed', 415), ('services', 1189), ('student', 641), ('technician', 1913), ('unemployed', 353)]
[('divorced', 1408), ('married', 7430), ('single', 4724)]
[('primary', 1874), ('secondary', 6899), ('tertiary', 4789)]
[('no', 13471), ('yes', 91)]
[('no', 5662), ('yes', 7900)]
[('no', 12120), ('yes', 1442)]
[('cellular', 12359), ('telephone', 1203)]
[('end', 1854), ('mid-1', 5831), ('mid-2', 1989), ('start', 3888)]

## END